{
  "definitions": {
    "copyright": "Copyright is a legal right granting the creator of original work exclusive rights to its use and distribution for a limited period.",
    "trademark": "A trademark is a recognizable sign, design, or expression identifying products or services of a particular source.",
    "patent": "A patent is an exclusive right granted for an invention, allowing the inventor to exclude others from making, using, or selling the invention.",
    "nda": "A Non-Disclosure Agreement (NDA) is a contract through which parties agree not to disclose confidential information shared between them.",
    "data privacy": "Data privacy refers to the handling, collection, and processing of personal information by organizations in compliance with privacy laws.",
    "cybercrime": "Cybercrime involves criminal activities using computers or the internet, such as hacking, phishing, or spreading malware.",
    "contract": "A contract is a legally enforceable agreement between two or more parties that creates mutual obligations.",
    "employment agreement": "A contract between employer and employee specifying roles, responsibilities, compensation, and legal obligations.",
    "partnership agreement": "A legal document outlining terms and responsibilities of partners in a business partnership.",
    "terms of service": "A set of rules and regulations a user agrees to when using a website or service.",
    "privacy policy": "A statement that explains how an organization collects, uses, and manages personal data.",
    "power of attorney": "A legal document allowing one person to act on behalf of another in legal or financial matters.",
    "will": "A legal document specifying how a person’s assets are to be distributed after death.",
    "trust": "A legal arrangement where a trustee holds property or assets for the benefit of beneficiaries.",
    "intellectual property": "Creations of the mind, such as inventions, literary works, and designs, protected by law.",
    "cyber law": "Laws that regulate internet and digital transactions and crimes.",
    "consumer rights": "Legal protections given to consumers against unfair trade practices.",
    "labor law": "Regulations governing employment, working conditions, and employee rights.",
    "nda breach": "Violation of the confidentiality terms stated in a Non-Disclosure Agreement.",
    "infringement": "Unauthorized use of protected intellectual property.",
    "licensing": "Permission granted to use copyrighted or patented work under certain conditions.",
    "fair use": "Legal doctrine allowing limited use of copyrighted material without permission under certain conditions.",
    "arbitration": "A method of dispute resolution outside the courts where an arbitrator makes a binding decision.",
    "mediation": "A form of dispute resolution where a mediator helps parties reach a mutual agreement.",
    "jurisdiction": "The legal authority of a court or entity to make decisions and judgments.",
    "statute": "A written law passed by a legislative body.",
    "regulation": "Rules issued by authorities to enforce laws.",
    "compliance": "Adhering to laws, regulations, and standards.",
    "intellectual property rights": "Legal rights protecting creations of the mind.",
    "nda template": "Preformatted agreement to protect confidential information.",
    "employment termination": "Ending of an employment contract by employer or employee.",
    "litigation": "Process of taking legal action in courts.",
    "cease and desist": "A legal order to stop certain actions, often related to infringement.",
    "dmca": "Digital Millennium Copyright Act, U.S. law protecting online copyright.",
    "plagiarism": "Copying someone else’s work without permission or attribution.",
    "cyber harassment": "Use of electronic communications to threaten, intimidate, or harass someone.",
    "data breach": "Unauthorized access or exposure of personal or confidential data.",
    "fdi law": "Foreign Direct Investment laws regulating international business investment.",
    "nda obligations": "Duties and responsibilities under a Non-Disclosure Agreement.",
    "contract clauses": "Specific sections in a contract that define rights and obligations.",
    "dispute resolution": "Process to resolve disagreements between parties.",
    "intellectual property infringement": "Unauthorized use or reproduction of protected IP.",
    "licensing agreement": "Contract granting permission to use intellectual property under defined terms.",
    "copyright notice": "Statement asserting copyright ownership.",
    "patent application": "Formal request submitted to protect an invention.",
    "trademark registration": "Legal process to protect a brand or logo.",
    "cease-and-desist letter": "Formal notice requesting someone to stop illegal activity.",
    "nda enforcement": "Legal actions taken to enforce a Non-Disclosure Agreement.",
    "employee handbook": "Document providing employees with policies and guidelines."
  },

  "legal_info": {
    "copyright infringement": "Unauthorized use of copyrighted work can lead to legal action including cease-and-desist notices, DMCA takedown requests, and civil lawsuits.",
    "trademark violation": "Trademark violations may result in legal notices, injunctions, or filing a lawsuit to stop unauthorized usage.",
    "patent infringement": "Using a patented invention without permission may result in licensing negotiations or legal action in courts.",
    "nda violation": "Breach of an NDA may lead to legal notice, damages claims, or injunctions.",
    "cybercrime complaint": "Report incidents to local police, cybercrime units, or CERT-In (India) with evidence preserved.",
    "data breach": "Notify affected users, comply with legal reporting obligations, and secure the system against further breaches.",
    "employment contract": "Review clauses, obligations, and rights under employment law before enforcing.",
    "consumer complaint": "File complaints with consumer forums or relevant government authorities if rights are violated.",
    "online harassment": "Document evidence, block offenders, and report to authorities as per cyber law provisions.",
    "online defamation": "Collect evidence and consult a lawyer for possible civil or criminal remedies.",
    "intellectual property enforcement": "Identify infringing parties, send notices, and pursue legal remedies as applicable.",
    "licensing dispute": "Review licensing agreement terms and negotiate or pursue dispute resolution.",
    "arbitration process": "Parties agree to a neutral arbitrator to resolve disputes outside court.",
    "mediation process": "A neutral mediator facilitates settlement between parties without litigation.",
    "contract enforcement": "Courts can enforce contracts that meet legal requirements of offer, acceptance, and consideration.",
    "jurisdiction issues": "Legal matters must be filed in courts with proper authority over the subject or location.",
    "fdi compliance": "Follow FDI rules on ownership, investment limits, and approvals.",
    "cease and desist": "Issue a formal notice to stop illegal or infringing activity immediately.",
    "dmca takedown": "For online copyright violations, file a DMCA takedown request to remove infringing content.",
    "employment termination": "Ensure termination follows contract terms and labor laws.",
    "nda obligations": "Parties must maintain confidentiality and avoid disclosure of sensitive information.",
    "contract clauses": "Clearly specify obligations, penalties, dispute resolution, and termination conditions.",
    "litigation guidance": "Consult a lawyer before filing lawsuits; preserve all relevant documents.",
    "plagiarism": "Unauthorized copying of work may lead to academic or legal penalties.",
    "cyber harassment report": "Report to authorities and retain chat logs, emails, or screenshots.",
    "privacy policy compliance": "Ensure all personal data collection and usage is in line with laws like GDPR or IT Act.",
    "employee handbook usage": "Provides clear guidelines to avoid disputes or misunderstandings."
  },

  "templates": {
    "nda": "NON-DISCLOSURE AGREEMENT (SAMPLE)\n\nThis NDA is entered between [Disclosing Party] and [Receiving Party]. The Receiving Party agrees to keep confidential all proprietary information shared by the Disclosing Party.\n\n[Clauses on obligations, exclusions, and term]\n\nSignatures:\n[Disclosing Party] _______\n[Receiving Party] _______",
    "basic_privacy_policy": "PRIVACY POLICY (SAMPLE)\n\nWe collect personal data necessary for our services. Data is stored securely and not shared without consent. Users have rights to access or delete data.\n\n[Further clauses]",
    "simple_contract": "EMPLOYMENT AGREEMENT (SAMPLE)\n\nBetween [Employer] and [Employee], detailing roles, responsibilities, salary, and confidentiality.\n\nSignatures:\n[Employer] _______\n[Employee] _______",
    "service_agreement": "SERVICE AGREEMENT (SAMPLE)\n\n[Service Provider] agrees to provide [Service] to [Client] under terms and conditions.\n\nSignatures:\n[Service Provider] _______\n[Client] _______",
    "power_of_attorney": "POWER OF ATTORNEY (SAMPLE)\n\n[Principal] appoints [Agent] to act on their behalf in matters of [scope].\n\nSignatures:\n[Principal] _______\n[Agent] _______",
    "employment_contract_template": "EMPLOYMENT CONTRACT (SAMPLE)\n\nDefines job role, salary, benefits, termination clauses, confidentiality.\n\nSignatures:\n[Employer] _______\n[Employee] _______",
    "freelancer_agreement": "FREELANCER AGREEMENT (SAMPLE)\n\nBetween [Client] and [Freelancer]. Scope of work, payment terms, and IP ownership.\n\nSignatures:\n[Client] _______\n[Freelancer] _______",
    "software_license": "SOFTWARE LICENSE AGREEMENT (SAMPLE)\n\nLicensor grants license to use software under defined terms.\n\nSignatures:\n[Licensor] _______\n[Licensee] _______",
    "nda_with_penalty": "NDA WITH PENALTY (SAMPLE)\n\nConfidentiality obligations include penalties for unauthorized disclosure.\n\nSignatures:\n[Disclosing Party] _______\n[Receiving Party] _______",
    "website_terms_of_service": "TERMS OF SERVICE (SAMPLE)\n\nUsers agree to rules and policies when using the website.\n\nSignatures:\n[Company] _______\n[User] _______",
    "nda_for_employees": "EMPLOYEE NDA (SAMPLE)\n\nEmployees agree to maintain confidentiality of company trade secrets.\n\nSignatures:\n[Company] _______\n[Employee] _______",
    "nda_for_clients": "CLIENT NDA (SAMPLE)\n\nClients agree to confidentiality terms regarding services or products.\n\nSignatures:\n[Company] _______\n[Client] _______",
    "contract_for_rent": "RENTAL AGREEMENT (SAMPLE)\n\nBetween landlord and tenant specifying property, rent, and obligations.\n\nSignatures:\n[Landlord] _______\n[Tenant] _______",
    "loan_agreement": "LOAN AGREEMENT (SAMPLE)\n\nSpecifies loan amount, repayment terms, and interest.\n\nSignatures:\n[Lender] _______\n[Borrower] _______",
    "nda_for_joint_ventures": "JOINT VENTURE NDA (SAMPLE)\n\nConfidentiality obligations for all parties involved in a joint venture.\n\nSignatures:\n[Party1] _______\n[Party2] _______",
    "intellectual_property_assignment": "IP ASSIGNMENT AGREEMENT (SAMPLE)\n\nAssigns IP rights from creator to company or client.\n\nSignatures:\n[Assignor] _______\n[Assignee] _______",
    "consultancy_agreement": "CONSULTANCY AGREEMENT (SAMPLE)\n\nDefines scope, fees, and deliverables between consultant and client.\n\nSignatures:\n[Consultant] _______\n[Client] _______",
    "nda_for_startups": "STARTUP NDA (SAMPLE)\n\nProtects confidential info shared with investors, partners, or employees.\n\nSignatures:\n[Startup] _______\n[Recipient] _______",
    "simple_mou": "MEMORANDUM OF UNDERSTANDING (SAMPLE)\n\nOutlines cooperation terms between two parties.\n\nSignatures:\n[Party1] _______\n[Party2] _______",
    "basic_letter_template": "LEGAL LETTER (SAMPLE)\n\n[Your Name]\n[Address]\n[Date]\n\nTo,\n[Recipient]\n\nSubject: [Subject]\n\nDear [Recipient],\n\n[Body of letter]\n\nSincerely,\n[Your Name]"
  }
}
